In [1]:
import numpy as np    # 1
import pandas as pd   # 2

import matplotlib.pyplot as plt # 3
import seaborn as sb            # 4

In [8]:
type(pd)

module

In [9]:
# pd?

In [10]:
from pandas import Series, DataFrame

In [11]:
s1 = pd.Series(data=[4, 6, 7, 10])

In [12]:
s1

0     4
1     6
2     7
3    10
dtype: int64

In [16]:
s2 = pd.Series(data=[4, 6, 7, 10], dtype="float32")

In [17]:
s2

0     4.0
1     6.0
2     7.0
3    10.0
dtype: float32

In [24]:
s2 = pd.Series(data=[4, 6, 7, 10], dtype="int32", index=['A', 'B', 'C', 'D'])

In [25]:
s2

A     4
B     6
C     7
D    10
dtype: int32

In [32]:
s3 = pd.Series(np.array([3,5,7]), dtype="int64", index=['A', 'B', 'C'])

In [33]:
s3

A    3
B    5
C    7
dtype: int64

In [36]:
# s4 = pd.Series(np.arange(5, 15))

In [38]:
basic_info = {"Id":5, "Name":"Bilal"}

In [39]:
s4 = pd.Series(data=basic_info)

In [40]:
s4

Id          5
Name    Bilal
dtype: object

In [41]:
s4.values

array([5, 'Bilal'], dtype=object)

In [42]:
s4.index

Index(['Id', 'Name'], dtype='object')

In [50]:
s5 = pd.Series(np.array([3,5,7]), dtype="int64", index=['A', 'B', 'C'])

In [51]:
s5

A    3
B    5
C    7
dtype: int64

In [55]:
df1 = pd.DataFrame([ [2,5,6], [7, 8, 10] ])

In [56]:
df1

   0  1   2
0  2  5   6
1  7  8  10

In [57]:
df2 = pd.DataFrame([ [2,5,6], [7, 8, 10] ], columns=['C1', 'C2', 'C3'])

In [59]:
df2

   C1  C2  C3
0   2   5   6
1   7   8  10

In [64]:
basic_info = {"Id":5, "Name":"Bilal"}

In [71]:
df3 = pd.DataFrame(basic_info, index=[0])

In [72]:
df3

   Id   Name
0   5  Bilal

In [86]:
basic_info = {
    "Id"   : [5, 10, 15],
    "Name" : ["Bilal", "Ahmad", "Khalil"],
    "CGPA" : [3.5, 3.7, 3.9],
    "Degree" : ["SE", "IT", "CS"]
}

In [87]:
basic_info

{'Id': [5, 10, 15],
 'Name': ['Bilal', 'Ahmad', 'Khalil'],
 'CGPA': [3.5, 3.7, 3.9],
 'Degree': ['SE', 'IT', 'CS']}

In [88]:
df4 = pd.DataFrame(basic_info)

In [89]:
df4

   Id    Name  CGPA Degree
0   5   Bilal   3.5     SE
1  10   Ahmad   3.7     IT
2  15  Khalil   3.9     CS

In [90]:
new_info = df4.pivot(index="Degree", columns="Name", values="CGPA")

In [91]:
new_info

Name    Ahmad  Bilal  Khalil
Degree
CS        NaN    NaN     3.9
IT        3.7    NaN     NaN
SE        NaN    3.5     NaN

# Data Collection

In [92]:
data = pd.read_csv('SimpleDataSet.csv')

In [93]:
type(data)

pandas.core.frame.DataFrame

In [94]:
data

     Name  CGPA Degree
0   Bilal  3.94     SE
1   Ahmad  3.78     IT
2  Khalil  3.70     CS
3  Rizwan  3.68     SE

In [96]:
data.head(3)

     Name  CGPA Degree
0   Bilal  3.94     SE
1   Ahmad  3.78     IT
2  Khalil  3.70     CS

In [98]:
data.tail(2)

     Name  CGPA Degree
2  Khalil  3.70     CS
3  Rizwan  3.68     SE

In [99]:
data.iloc[2:4]

     Name  CGPA Degree
2  Khalil  3.70     CS
3  Rizwan  3.68     SE

In [100]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Name      4 non-null object
CGPA      4 non-null float64
Degree    4 non-null object
dtypes: float64(1), object(2)
memory usage: 176.0+ bytes

In [101]:
data.describe()

           CGPA
count  4.000000
mean   3.775000
std    0.118181
min    3.680000
25%    3.695000
50%    3.740000
75%    3.820000
max    3.940000

In [106]:
my_rd = pd.read_csv('data.csv')

In [109]:
# my_rd.describe()

In [110]:
my_rd.head()

,Unnamed: 0,ID,Name,Age,Photo,Nationality,Flag,Overall,Potential,Club,...,Composure,Marking,StandingTackle,SlidingTackle,GKDiving,GKHandling,GKKicking,GKPositioning,GKReflexes,Release Clause
0,0,158023,L. Messi,31,https://cdn.sofifa.org/players/4/19/158023.png,Argentina,https://cdn.sofifa.org/flags/52.png,94,94,FC Barcelona,...,96.0,33.0,28.0,26.0,6.0,11.0,15.0,14.0,8.0,€226.5M
1,1,20801,Cristiano Ronaldo,33,https://cdn.sofifa.org/players/4/19/20801.png,Portugal,https://cdn.sofifa.org/flags/38.png,94,94,Juventus,...,95.0,28.0,31.0,23.0,7.0,11.0,15.0,14.0,11.0,€127.1M
2,2,190871,Neymar Jr,26,https://cdn.sofifa.org/players/4/19/190871.png,Brazil,https://cdn.sofifa.org/flags/54.png,92,93,Paris Saint-Germain,...,94.0,27.0,24.0,33.0,9.0,9.0,15.0,15.0,11.0,€228.1M
3,3,193080,De Gea,27,https://cdn.sofifa.org/players/4/19/193080.png,Spain,https://cdn.sofifa.org/flags/45.png,91,93,Manchester United,...,68.0,15.0,21.0,13.0,90.0,85.0,87.0,88.0,94.0,€138.6M
4,4,192985,K. De Bruyne,27,https://cdn.sofifa.org/players/4/19/192985.png,Belgium,https://cdn.sofifa.org/flags/7.png,91,92,Manchester City,...,88.0,68.0,58.0,51.0,15.0,13.0,5.0,10.0,13.0,€196.4M

In [112]:
# my_rd.isnull()